In [1]:
dict={'a':2,'b':4,'c':6}
dict

{'a': 2, 'b': 4, 'c': 6}

In [2]:
type(dict)

dict

In [3]:
import pandas as pd

In [4]:
import numpy as np

In [6]:
my_Ser = pd.Series([1,2,3,'hello','Hi'])
my_Ser

0        1
1        2
2        3
3    hello
4       Hi
dtype: object

In [9]:
#Read Csv file 

file = r'D:\Personal\Udemy-Training\complete-data-wrangling-data-visualisation-with-python\Data-and-Code\Data and Code\section 2\Resp2.csv'
data = pd.read_csv(file)
data.head()

   experience  respiration
0           0         3.94
1           0         4.26
2           0         4.16
3           0         3.76
4           0         4.07

In [12]:
file1 = r"D:\Personal\Udemy-Training\complete-data-wrangling-data-visualisation-with-python\Data-and-Code\Data and Code\section 2\winequality-red.csv"
data1 = pd.read_csv(file1,sep=';').head()
data1

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [38]:
#read TXT file


df1=pd.read_csv(r"D:\Personal\Udemy-Training\complete-data-wrangling-data-visualisation-with-python\Data-and-Code\Data and Code\section 2\bostonTxt.txt", sep = "\t")
df1.head()

     MV  INDUS   NOX     RM  TAX    PT  LSTAT
0  24.0   2.31  53.8  6.575  296  15.3   4.98
1  21.6   7.07  46.9  6.421  242  17.8   9.14
2  34.7   7.07  46.9  7.185  242  17.8   4.03
3  33.4   2.18  45.8  6.998  222  18.7   2.94
4  36.2   2.18  45.8  7.147  222  18.7   5.33

In [35]:
import os
os.getcwd()

file4 = 'D:\\Personal\\Udemy-Training\\complete-data-wrangling-data-visualisation-with-python\\Data-and-Code\\Data and Code\\section 2\\boston1.xls'
x1=pd.ExcelFile(file4)
print(x1.sheet_names)
df3 = x1.parse('Sheet2')
#df3.head()
df3.info()

['Sheet1', 'Sheet2']
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 7 columns):
MV       11 non-null float64
INDUS    11 non-null float64
NOX      11 non-null float64
RM       11 non-null float64
TAX      11 non-null int64
PT       11 non-null float64
LSTAT    11 non-null float64
dtypes: float64(6), int64(1)
memory usage: 696.0 bytes

In [36]:
df3.head()

     MV  INDUS   NOX     RM  TAX    PT  LSTAT
0  24.0   2.31  53.8  6.575  296  15.3   4.98
1  21.6   7.07  46.9  6.421  242  17.8   9.14
2  34.7   7.07  46.9  7.185  242  17.8   4.03
3  33.4   2.18  45.8  6.998  222  18.7   2.94
4  36.2   2.18  45.8  7.147  222  18.7   5.33

In [33]:
df2 = pd.read_excel(r"D:\Personal\Udemy-Training\complete-data-wrangling-data-visualisation-with-python\Data-and-Code\Data and Code\section 2\boston1.xls")
#df2.describe()
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506 entries, 0 to 505
Data columns (total 10 columns):
MV            506 non-null float64
INDUS         506 non-null float64
NOX           506 non-null float64
RM            506 non-null float64
TAX           506 non-null int64
PT            506 non-null float64
LSTAT         506 non-null float64
Unnamed: 7    0 non-null float64
Unnamed: 8    0 non-null float64
Unnamed: 9    4 non-null object
dtypes: float64(8), int64(1), object(1)
memory usage: 39.6+ KB

In [37]:
df2.head()

,MV,INDUS,NOX,RM,TAX,PT,LSTAT,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,24.0,2.31,53.8,6.575,296,15.3,4.98,NaN,NaN,Subset of Boston housing tract
1,21.6,7.07,46.9,6.421,242,17.8,9.14,NaN,NaN,data of Harrison and Rubinfeld
2,34.7,7.07,46.9,7.185,242,17.8,4.03,NaN,NaN,(1978). Each case is one U.S.
3,33.4,2.18,45.8,6.998,222,18.7,2.94,NaN,NaN,Census tract in the Boston area.
4,36.2,2.18,45.8,7.147,222,18.7,5.33,NaN,NaN,NaN

In [39]:
df2.describe()

,MV,INDUS,NOX,RM,TAX,PT,LSTAT,Unnamed: 7,Unnamed: 8
count,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,0.0,0.0
mean,22.532806,11.136779,55.469506,6.284634,408.237154,18.455534,12.653063,NaN,NaN
std,9.197104,6.860353,11.587768,0.702617,168.537116,2.164946,7.141062,NaN,NaN
min,5.000000,0.460000,38.500000,3.561000,187.000000,12.600000,1.730000,NaN,NaN
25%,17.025000,5.190000,44.900000,5.885500,279.000000,17.400000,6.950000,NaN,NaN
50%,21.200000,9.690000,53.800000,6.208500,330.000000,19.050000,11.360000,NaN,NaN
75%,25.000000,18.100000,62.400000,6.623500,666.000000,20.200000,16.955000,NaN,NaN
max,50.000000,27.740000,87.100000,8.780000,711.000000,22.000000,37.970000,NaN,NaN

In [70]:
df2.isnull()

MV            506
INDUS         506
NOX           506
RM            506
TAX           506
PT            506
LSTAT         506
Unnamed: 7    506
Unnamed: 8    506
Unnamed: 9    506
dtype: int64

In [40]:
# Read HTML
import html5lib

In [43]:
webdata1 = pd.read_html("https://www.w3schools.com/html/html_tables.asp")
webdata1

[                        Company           Contact  Country
 0           Alfreds Futterkiste      Maria Anders  Germany
 1    Centro comercial Moctezuma   Francisco Chang   Mexico
 2                  Ernst Handel     Roland Mendel  Austria
 3                Island Trading     Helen Bennett       UK
 4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
 5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy,
           Tag                                        Description
 0     <table>                                    Defines a table
 1        <th>                   Defines a header cell in a table
 2        <tr>                           Defines a row in a table
 3        <td>                          Defines a cell in a table
 4   <caption>                            Defines a table caption
 5  <colgroup>  Specifies a group of one or more columns in a ...
 6       <col>  Specifies column properties for each column wi...
 7     <thead>               Groups the header content in a table
 8     <tbody>                 Groups the body content in a table
 9     <tfoot>               Groups the footer content in a table]

In [44]:
type(webdata1)

list

In [47]:
len(webdata1)

2

In [48]:
webdata1[0]

                        Company           Contact  Country
0           Alfreds Futterkiste      Maria Anders  Germany
1    Centro comercial Moctezuma   Francisco Chang   Mexico
2                  Ernst Handel     Roland Mendel  Austria
3                Island Trading     Helen Bennett       UK
4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy

In [72]:
webdata1[0].iloc[0:,0:1]

                        Company
0           Alfreds Futterkiste
1    Centro comercial Moctezuma
2                  Ernst Handel
3                Island Trading
4  Laughing Bacchus Winecellars
5  Magazzini Alimentari Riuniti

In [68]:
webdata1[0].loc[:,['Company','Contact']]

                        Company           Contact
0           Alfreds Futterkiste      Maria Anders
1    Centro comercial Moctezuma   Francisco Chang
2                  Ernst Handel     Roland Mendel
3                Island Trading     Helen Bennett
4  Laughing Bacchus Winecellars   Yoshi Tannamuri
5  Magazzini Alimentari Riuniti  Giovanni Rovelli